
from email import message
from xml.dom import ValidationErr
from django.db import models
from django.contrib.auth.models import User



# Create your models here.
from django.conf import settings
from django.db.models.signals import post_save
from django.dispatch import receiver
from rest_framework.authtoken.models import Token

from django.db import models
from django.core.exceptions import ValidationError

@receiver(post_save, sender=settings.AUTH_USER_MODEL)
def create_auth_token(sender, instance=None, created=False, **kwargs):
    if created:
        Token.objects.create(user=instance)

class Ustadz(models.Model):
    user = models.OneToOneField(User, null=True,  on_delete=models.CASCADE)
    name = models.CharField(max_length=200, blank=True, null=True)
    phone = models.CharField(max_length=200, blank=True, null=True)
    email = models.CharField(max_length=200, blank=True, null=True)
    date_created = models.DateTimeField(auto_now_add=True, null=True)

    def __str__(self):
        return self.name



class Mahasantri(models.Model):
    JK = (
        ('Laki-Laki', 'Laki-Laki'),
        ('Perempuan', 'Perempuan'),

    )
    STATUS = (
        ('Siswa', 'Siswa'),
        ('Mahasiswa', 'Mahasiswa'),

    )
    name = models.CharField(max_length=200, blank=True, null=True)
    jk = models.CharField(max_length=200, blank=True, null=True, choices=JK)
    status = models.CharField(max_length=200, blank=True, null=True, choices=STATUS)
    date_created = models.DateTimeField(auto_now_add=True, null=True)

    def __str__(self):
        return str(self.name)


class Kitab(models.Model):
    HALAMAN = (
        ('1', '1'),
        ('2', '2'),
        ('3', '3'),
        ('4', '4'),
        ('5', '5'),
        ('6', '6'),
        ('7', '7'),
        ('8', '8'),
        ('9', '9'),
        ('10', '10'),
        ('11', '11'),
        ('12', '12'),
        ('13', '13'),
        ('14', '14'),
        ('15', '15'),
        ('16', '16'),
        ('17', '17'),
        ('18', '18'),
        ('19', '19'),
        ('20', '20'),
        ('21', '21'),
        ('22', '22'),
        ('23', '23'),
        ('24', '24'),
        ('25', '25'),
        ('26', '26'),
        ('27', '27'),
        ('28', '28'),
        ('29', '29'),
        ('30', '30'),
        ('31', '31'),
        ('32', '32'),
        ('33', '33'),
        ('34', '34'),
        ('35', '35'),
        ('36', '36'),
        ('37', '37'),
        ('38', '38'),
        ('39', '39'),
        ('40', '40'),
        ('41', '41'),
        ('42', '42'),
        ('43', '43'),
        ('44', '44'),
        ('45', '45'),
        ('46', '46'),
        ('47', '47'),
        ('48', '48'),
        ('49', '49'),
        ('50', '50'),
        ('51', '51'),
        ('52', '52'),
        ('53', '53'),
        ('54', '54'),
        ('55', '55'),
        ('56', '56'),
        ('57', '57'),
        ('58', '58'),
        ('59', '59'),
        ('60', '60'),
        ('71', '71'),
        ('72', '72'),
        ('73', '73'),
        ('74', '74'),
        ('75', '75'),
        ('76', '76'),
        ('77', '77'),
        ('78', '78'),
        ('79', '79'),
        ('80', '80'),
    )
    FASOL = (
        ('.....', '......'),
        ('Muqaddimah', 'Muqaddimah'),
        ('فصل: في ذكر شيء من الأعيان المتنجسة ', 'فصل: في ذكر شيء من الأعيان المتنجسة '),
        ('فصل: في بيان ما يحرم استعماله من الأواني وما يجوز', 'فصل: في بيان ما يحرم استعماله من الأواني وما يجوز'),
        ('فصل: في استعمال آلة السواك', 'فصل: في استعمال آلة السواك'),
        ('فصل: في فروض الوضوء', 'فصل: في فروض الوضوء'),
        ('فصل: في الاستنجاء وآداب قاضي الحاجة ', 'فصل: في الاستنجاء وآداب قاضي الحاجة '),
        ('فصل: في نواقض الوضوء', 'فصل: في نواقض الوضوء'),
        (' فصل: في موجب الغسل', ' فصل: في موجب الغسل'),
        ('فصل: وفرائض الغسل ثلاثة أشياء', 'فصل: وفرائض الغسل ثلاثة أشياء'),
        ('فصل: والاغتسالات المسنونة', 'فصل: والاغتسالات المسنونة'),
        ('فصل: والمسح على الخفين جائز في الوضوء ', 'فصل: والمسح على الخفين جائز في الوضوء '),
        ('فصل: في التيمم.', 'فصل: في التيمم.'),
        ('فصل: في بيان النجاسات وإزالتها', 'فصل: في بيان النجاسات وإزالتها'),
        ('فصل: في الحيض والنفاس والاستحاضة ', 'فصل: في الحيض والنفاس والاستحاضة '),
        ('فصل: وشرائط وجوب الصلاة ثلاثة أشياء', 'فصل: وشرائط وجوب الصلاة ثلاثة أشياء'),
        ('فصل: وشرائط الصلاة', 'فصل: وشرائط الصلاة'),
        ('فصل: في أركان الصلاة', 'فصل: في أركان الصلاة'),
        (' فصل: في أمور تخالف فيها المرأة الرجل في الصلاة', ' فصل: في أمور تخالف فيها المرأة الرجل في الصلاة'),
        ('فصل: في عدد مبطلات الصلاة', 'فصل: في عدد مبطلات الصلاة'),
        ('فصل: في عدد ركعات الصلاة ', 'فصل: في عدد ركعات الصلاة '),
        ('فصل: والمتروك من الصلاة ثلاثة أشياء فرض', 'فصل: والمتروك من الصلاة ثلاثة أشياء فرض'),
        ('فصل: في الأوقات التي تكره الصلاة', 'فصل: في الأوقات التي تكره الصلاة'),
        ('فصل: وصلاة الجماعة', 'فصل: وصلاة الجماعة'),
        ('فصل: في قصر الصلاة وجمعها', 'فصل: في قصر الصلاة وجمعها'),
        ('فصل: وشرائط وجوب الجمعة', 'فصل: وشرائط وجوب الجمعة'),
        ('فصل: وصلاة العيدين أي الفطر والأضحى ', 'فصل: وصلاة العيدين أي الفطر والأضحى '),
        ('فصل: وصلاة الكسوف للشمس ', 'فصل: وصلاة الكسوف للشمس '),
        ('فصل: في أحكام صلاة الاستسقاء', 'فصل: في أحكام صلاة الاستسقاء'),
        ('فصل: في كيفية صلاة الخوف', 'فصل: في كيفية صلاة الخوف'),
        ('فصل: في اللباس ', 'فصل: في اللباس '),
        ('فصل: فيما يتعلق بالميت ', 'فصل: فيما يتعلق بالميت '),
        ('فصل: وأول نصاب الإبل', 'فصل: وأول نصاب الإبل'),
        ('فصل: وأول نصاب البقر', 'فصل: وأول نصاب البقر'),
        ('فصل: وأول نصاب ', 'فصل: وأول نصاب '),
        ('فصل: والخليطان يزكيان', 'فصل: والخليطان يزكيان'),
        ('فصل: ونصاب الذهب ', 'فصل: ونصاب الذهب '),
        ('فصل: ونصاب الزروع والثمار ', 'فصل: ونصاب الزروع والثمار '),
        ('فصل: وتقوم عروض التجارة ', 'فصل: وتقوم عروض التجارة '),
        ('فصل: وتجب زكاة الفطر ', 'فصل: وتجب زكاة الفطر '),
        ('فصل: وتدفع الزكاة ', 'فصل: وتدفع الزكاة '),
        ('فصل: في أحكام الاعتكاف ', 'فصل: في أحكام الاعتكاف '),
        ('فصل: في أحكام محرمات الإحرام', 'فصل: في أحكام محرمات الإحرام'),
        ('فصل: في أنواع الدماء الواجبة ', 'فصل: في أنواع الدماء الواجبة '),
        ('فصل: في الربا بألف ', 'فصل: في الربا بألف '),
        ('فصل: في أحكام الخيار ', 'فصل: في أحكام الخيار '),
        ('فصل: في أحكام السلم ', 'فصل: في أحكام السلم '),
        ('فصل: في أحكام الرهن ', 'فصل: في أحكام الرهن '),
        ('فصل: في حجر السفيه والمفلس ', 'فصل: في حجر السفيه والمفلس '),
        ('فصل: في الصلح ', 'فصل: في الصلح '),
        ('فصل: في الحوالة ', 'فصل: في الحوالة '),
        ('فصل: في الضمان ', 'فصل: في الضمان '),
        ('فصل: في الشركة ', 'فصل: في الشركة '),
        ('فصل: في أحكام الوكالة ', 'فصل: في أحكام الوكالة '),
        ('فصل: في أحكام الإقرار', 'فصل: في أحكام الإقرار'),
        ('فصل: في أحكام العارية ', 'فصل: في أحكام العارية '),
        ('فصل: في أحكام الغصب ', 'فصل: في أحكام الغصب '),
        ('فصل: في أحكام الشفعة ', 'فصل: في أحكام الشفعة '),
        (' فصل: في أحكام القراض', ' فصل: في أحكام القراض'),
        ('فصل: في أحكام المساقاة ', 'فصل: في أحكام المساقاة '),
        ('فصل: في أحكام الإجارة ', 'فصل: في أحكام الإجارة '),
        ('فصل: في أحكام الجعالة', 'فصل: في أحكام الجعالة'),
        ('فصل: في أحكام المخابرة ', 'فصل: في أحكام المخابرة '),
        ('فصل: في أحكام إحياء الموات ', 'فصل: في أحكام إحياء الموات '),
        ('فصل: في أحكام الوقف ', 'فصل: في أحكام الوقف '),
        ('فصل: في أحكام الهبة ', 'فصل: في أحكام الهبة '),
        ('فصل: في أحكام اللقطة ', 'فصل: في أحكام اللقطة '),
        ('فصل: في أحكام اللقيط ', 'فصل: في أحكام اللقيط '),
        ('فصل: في أحكام الوديعة ', 'فصل: في أحكام الوديعة '),
        ('فصل: والفروض المقدرة ', 'فصل: والفروض المقدرة '),
        ('فصل: في أحكام الوصية ', 'فصل: في أحكام الوصية '),
        ('فصل: فيما لا يصح النكاح إلا به ', 'فصل: فيما لا يصح النكاح إلا به '),
        ('(فصل: والمحرمات)', '(فصل: والمحرمات)'),
        ('فصل: في أحكام الصداق ', 'فصل: في أحكام الصداق '),
        ('فصل: والوليمة على العرس ', 'فصل: والوليمة على العرس '),
        ('فصل: في أحكام القسم والنشوز ', 'فصل: في أحكام القسم والنشوز '),
        ('فصل: في أحكام الخلع', 'فصل: في أحكام الخلع'),
        ('فصل: في أحكام الطلاق ', 'فصل: في أحكام الطلاق '),
        ('فصل: في حكم طلاق الحر', '     فصل: في حكم طلاق الحر'),
        ('فصل: في أحكام الرجعة ', 'فصل: في أحكام الرجعة '),
        ('فصل: في بيان أحكام الإيلاء ', 'فصل: في بيان أحكام الإيلاء '),
        ('فصل: في بيان أحكام الظهار ', 'فصل: في بيان أحكام الظهار '),
        ('فصل: في بيان أحكام القذف اللعان', 'فصل: في بيان أحكام القذف اللعان'),
        ('فصل: في أحكام العدة وأنواع المعتدة ', 'فصل: في أحكام العدة وأنواع المعتدة '),
        ('فصل: في أنواع المعتدة وأحكامها ', 'فصل: في أنواع المعتدة وأحكامها '),
        ('فصل: في أحكام الاستبراء ', 'فصل: في أحكام الاستبراء '),
        ('فصل: في أحكام الرضاع', 'فصل: في أحكام الرضاع'),
        ('فصل: في أحكام نفقة الأقارب ', 'فصل: في أحكام نفقة الأقارب '),
        ('فصل: في أحكام الحضانة ', 'فصل: في أحكام الحضانة '),
        ('فصل: في بيان الدية ', 'فصل: في بيان الدية '),
        ('فصل: في أحكام القسامة ', 'فصل: في أحكام القسامة '),
        ('فصل: في أحكام القذف', 'فصل: في أحكام القذف'),
        ('فصل: في أحكام الأشربة ', 'فصل: في أحكام الأشربة '),
        ('فصل: في أحكام قطع السرقة ', 'فصل: في أحكام قطع السرقة '),
        ('فصل: في أحكام قاطع الطريق ', 'فصل: في أحكام قاطع الطريق '),
        ('فصل: في أحكام الصيال ', 'فصل: في أحكام الصيال '),
        ('فصل: في أحكام البغاة', 'فصل: في أحكام البغاة'),
        ('فصل: في أحكام الردة ', 'فصل: في أحكام الردة '),
        ('(فصل: وتارك الصلاة) ', '(فصل: وتارك الصلاة) '),
        ('فصل: في أحكام السلب ', 'فصل: في أحكام السلب '),
        ('فصل: في قسم الفيء على مستحقيه ', 'فصل: في قسم الفيء على مستحقيه '),
        ('فصل: في أحكام الجزية ', 'فصل: في أحكام الجزية '),
        ('فصل: في أحكام الأطعمة الحلال', 'فصل: في أحكام الأطعمة الحلال'),
        ('فصل: في أحكام الأضحية ', 'فصل: في أحكام الأضحية '),
        ('فصل: في أحكام العقيقة ', 'فصل: في أحكام العقيقة '),
        ('فصل: في أحكام النذور', 'فصل: في أحكام النذور'),
        ('فصل: في أحكام القسمة ', 'فصل: في أحكام القسمة '),
        ('فصل: في الحكم بالبينة ', 'فصل: في الحكم بالبينة '),
        ('فصل: في شروط الشاهد', 'فصل: في شروط الشاهد'),
        ('فصل والحقوق ضربان أحدهما ', 'فصل والحقوق ضربان أحدهما '),
        ('فصل: في أحكام الولاء ', 'فصل: في أحكام الولاء '),
        ('فصل: في أحكام التدبير ', 'فصل: في أحكام التدبير '),
        ('فصل: في أحكام الكتابة', 'فصل: في أحكام الكتابة'),
        ('فصل: في أحكام أمهات الأولاد ', 'فصل: في أحكام أمهات الأولاد '),
    )
    BAB = (
        ('.....', '.....'),
        ('Muqaddimah', 'Muqaddimah'),
        ('كتاب أحكام الطهارة', 'كتاب أحكام الطهارة'),
        ('كتاب أحكام الصلاة', 'كتاب أحكام الصلاة'),
        ('كتاب أحكام الزكاة', 'كتاب أحكام الزكاة'),
        ('كتاب بيان أحكام الصيام', 'كتاب بيان أحكام الصيام'),
        ('كتاب أحكام الحج', 'كتاب أحكام الحج'),
        ('كتاب أحكام البيوع', 'كتاب أحكام البيوع'),
        ('كتاب أحكام الفرائض والوصايا', 'كتاب أحكام الفرائض والوصايا'),
        ('كتاب أحكام النكاح وما يتعلق به', 'كتاب أحكام النكاح وما يتعلق به'),
        ('كتاب أحكام الجنايات', 'كتاب أحكام الجنايات'),
        ('كتاب بيان الحدود', 'كتاب بيان الحدود'),
        ('كتاب أحكام الجهاد', 'كتاب أحكام الجهاد'),
        ('كتاب أحكام الصيد والذبائح والأطعمة', 'كتاب أحكام الصيد والذبائح والأطعمة'),
        ('كتاب أحكام السبق والرمي', 'كتاب أحكام السبق والرمي'),
        ('كتاب أحكام الأيمان والنذور', 'كتاب أحكام الأيمان والنذور'),
        ('كتاب أحكام الأقضية والشهادات', 'كتاب أحكام الأقضية والشهادات'),
        ('كتاب أحكام العتق', 'كتاب أحكام العتق'),
        
    )
    
            
    awalan = models.CharField(max_length=200, blank=True, null=True)
    halaman = models.CharField(max_length=200, blank=True, null=True, choices=HALAMAN)
    fasol = models.CharField(max_length=200, blank=True, null=True, choices=FASOL)
    bab = models.CharField(max_length=200, blank=True, null=True, choices=BAB)
    isi = models.TextField()
    date_created = models.DateTimeField(auto_now_add=True, null=True)

    def __str__(self):
        return self.awalan


class Setoran(models.Model):
    NILAI = (
        ('A','A'),
        ('B','B'),
        ('C','C'),
        ('D','D'),
    )
    
    mahasantri = models.ForeignKey(Mahasantri, null=True, on_delete=models.SET_NULL)
    kitab = models.ForeignKey(Kitab, null=True, on_delete=models.SET_NULL)
    nilai = models.CharField(max_length=200, blank=True, null=True, choices=NILAI)
    catatan = models.CharField(max_length=200, blank=True, null=True)
    lulus = models.BooleanField()
    time_created = models.TimeField(auto_now_add=True, null=True,)
    date_created = models.DateField(auto_now_add=True, null=True,)

    def __init__(self, *args, **kwargs):
        super().__init__(*args, **kwargs)
      
        if self.nilai == "A":
            self.lulus = True
        elif self.nilai == "B":
            self.lulus = True
        elif self.nilai == "C":
            self.lulus = True
        else:
            self.lulus = False
      